Ran Plan for project: `terraform-test` dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # consul_service.consul_service_ssh has been deleted
- resource "consul_service" "consul_service_ssh" {
      - address             = "172.25.0.50" -> null
      - datacenter          = "room101" -> null
      - enable_tag_override = false -> null
      - id                  = "terraform-test-ssh" -> null
      - name                = "terraform-test-ssh" -> null
      - node                = "terraform-test" -> null
      - port                = 22 -> null
      - service_id          = "terraform-test-ssh" -> null

      - check {
          - check_id                          = "terraform-test:ssh" -> null
          - deregister_critical_service_after = "30s" -> null
          - interval                          = "10s" -> null
          - method                            = "GET" -> null
          - name                              = "SSH TCP on port 22" -> null
          - status                            = "critical" -> null
          - tcp                               = "172.25.0.50:22" -> null
          - timeout                           = "2s" -> null
          - tls_skip_verify                   = false -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # consul_service.consul_service_ssh will be created
+ resource "consul_service" "consul_service_ssh" {
      + address    = "172.25.0.50"
      + datacenter = (known after apply)
      + id         = (known after apply)
      + name       = "terraform-test-ssh"
      + node       = "terraform-test"
      + port       = 22
      + service_id = (known after apply)

      + check {
          + check_id                          = "terraform-test:ssh"
          + deregister_critical_service_after = "30s"
          + interval                          = "10s"
          + method                            = "GET"
          + name                              = "SSH TCP on port 22"
          + status                            = (known after apply)
          + tcp                               = "172.25.0.50:22"
          + timeout                           = "2s"
          + tls_skip_verify                   = false
        }
    }

  # module.instance.proxmox_vm_qemu.proxmox_instance will be created
+ resource "proxmox_vm_qemu" "proxmox_instance" {
      + additional_wait           = 15
      + agent                     = 1
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = "c"
      + bootdisk                  = (known after apply)
      + cicustom                  = "user=nfs-cloudinit:snippets/user-terraform-test-node-room101-a7d,network=nfs-cloudinit:snippets/network-terraform-test-node-room101-a7d"
      + clone                     = "template-ubuntu-2004-base-image"
      + clone_wait                = 15
      + cloudinit_cdrom_storage   = "nfs-cloudinit"
      + cores                     = 1
      + cpu                       = "host"
      + default_ipv4_address      = (known after apply)
      + define_connection_info    = true
      + desc                      = "instance for internal infra management"
      + force_create              = false
      + full_clone                = true
      + guest_agent_ready_timeout = 600
      + hotplug                   = "network,disk,usb"
      + id                        = (known after apply)
      + kvm                       = true
      + memory                    = 2048
      + name                      = "terraform-test.node.room101.a7d"
      + nameserver                = "10.101.0.45"
      + numa                      = false
      + onboot                    = true
      + os_type                   = "cloud-init"
      + pool                      = "infrastructure"
      + preprovision              = true
      + reboot_required           = (known after apply)
      + scsihw                    = (known after apply)
      + searchdomain              = "analbeard.com"
      + sockets                   = 1
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + target_node               = "host-03"
      + unused_disk               = (known after apply)
      + vcpus                     = 0
      + vlan                      = -1
      + vmid                      = 250

      + disk {
          + backup       = 0
          + cache        = "none"
          + file         = (known after apply)
          + format       = (known after apply)
          + iothread     = 0
          + mbps         = 0
          + mbps_rd      = 0
          + mbps_rd_max  = 0
          + mbps_wr      = 0
          + mbps_wr_max  = 0
          + media        = (known after apply)
          + replicate    = 0
          + size         = "15G"
          + slot         = (known after apply)
          + ssd          = 0
          + storage      = "local-lvm"
          + storage_type = (known after apply)
          + type         = "scsi"
          + volume       = (known after apply)
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + link_down = false
          + macaddr   = "2E:60:91:44:43:1E"
          + model     = "virtio"
          + queues    = (known after apply)
          + rate      = (known after apply)
          + tag       = 1001
        }
    }

  # module.instance_cloudinit_template.null_resource.cloudinit_network is tainted, so must be replaced
-/+ resource "null_resource" "cloudinit_network" {
      ~ id = "1055166275967717172" -> (known after apply)
    }

  # module.instance_cloudinit_template.null_resource.cloudinit_userdata is tainted, so must be replaced
-/+ resource "null_resource" "cloudinit_userdata" {
      ~ id = "5334380268528756015" -> (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.
╷
│ Warning: Experimental feature "module_variable_optional_attrs" is active
│ 
│   on .terraform/modules/instance/versions.tf line 14, in terraform:
│   14:   experiments = [module_variable_optional_attrs]
│ 
│ Experimental features are subject to breaking changes in future minor or
│ patch releases, based on feedback.
│ 
│ If you have feedback on the design of this feature, please open a GitHub
│ issue to discuss it.
│ 
│ (and one more similar warning elsewhere)
╵

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-test`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.lab.analbeard.com/lock?id=glitchcrab%252Fterraform-test%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-test`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 4 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
